Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hal/inc/rx72n_mpc_regs.h
/* lib/rx_hal/inc/rx72n_mpc_regs.h */

/**
 * @file rx72n_mpc_regs.h
 * @brief RX72N Multi-Function Pin Controller (MPC) Register Definitions
 *
 * @details
 * Register definitions for the Multi-Function Pin Controller (MPC) peripheral
 * on the RX72N microcontroller. MPC configures which peripheral function is
 * connected to each GPIO pin (pin multiplexing).
 *
 * @par MPC System Architecture
 * @verbatim
 *                    RX72N Multi-Function Pin Controller Architecture
 *   +-----------------------------------------------------------------------+
 *   |                         MPC Module (0x0008C100)                       |
 *   |                                                                       |
 *   |  +------------+     +------------+     +----------------------------+ |
 *   |  |   PWPR     |     | Bus Ctrl   |     |    PFS Registers           | |
 *   |  | (Protect)  |     | (External) |     |    (Pin Function)          | |
 *   |  +------+-----+     +------------+     +------------+---------------+ |
 *   |         |                                           |                 |
 *   |         | Unlock                                    | PSEL[4:0]       |
 *   |         v                                           v                 |
 *   +---------+-------------------------------------------+-----------------+
 *             |                                           |
 *             |                                           v
 *   +---------+--------------------------------------------------------------+
 *   |                        Pin Multiplexer Matrix                         |
 *   |  +-----------------------------------------------------------------+  |
 *   |  |   Physical Pin  <----- MUX <--- [GPIO, SCI, SPI, I2C, MTU, ...]  |  |
 *   |  +-----------------------------------------------------------------+  |
 *   +------------------------------------------------------------------------+
 *
 *   PFS Write Protection Sequence:
 *   +--------+    +---------+    +---------+    +--------+    +--------+
 *   | PWPR   | ->  | PWPR    | ->  | Write   | ->  | PWPR   | ->  | PWPR   |
 *   | =0x00  |    | =0x40   |    | PnmPFS  |    | =0x00  |    | =0x80  |
 *   |(B0WI=0)|    |(PFSWE=1)|    |         |    |(PFSWE=0|    |(B0WI=1)|
 *   +--------+    +---------+    +---------+    +--------+    +--------+
 *
 *   Memory Map (Verified against RX72N Manual Ch20):
 *   +------------+----------------------------------------------+
 *   |  Address   |  Register                                    |
 *   +------------+----------------------------------------------+
 *   | 0x0008C100 |  PFCSE (CS Output Enable)                    |
 *   | 0x0008C102 |  PFCSS0/1 (CS Output Pin Select)             |
 *   | 0x0008C104 |  PFAOE0/1 (Address Output Enable)            |
 *   | 0x0008C106 |  PFBCR0-3 (External Bus Control)             |
 *   | 0x0008C10E |  PFENET (Ethernet Control)                   |
 *   | 0x0008C11F |  PWPR (Write Protect Register)               |
 *   | 0x0008C128 |  DSCR2[24] (Drive Capacity Control)          |
 *   | 0x0008C140 |  P00PFS - PJ5PFS (Pin Function Select)       |
 *   +------------+----------------------------------------------+
 *
 *   STAR Project Pin Assignments (144-pin LFQFP):
 *   +----------+---------+------+--------------------------------+
 *   |  Pin     |  Port   | PSEL |  Function                      |
 *   +----------+---------+------+--------------------------------+
 *   | USB D+/- | (USB)   |  -   |  USB CDC Debug                 |
 *   | Pin 72   | PB7     | 0x0A |  SCI9-TXD (Debug UART TX)      |
 *   | Pin 74   | PB6     | 0x0A |  SCI9-RXD (Debug UART RX)      |
 *   | Pin 32   | PA0     | 0x0D |  RSPI0-MOSIA (SPI COPI)        |
 *   | Pin 33   | PA1     | 0x0D |  RSPI0-MISOA (SPI CIPO)        |
 *   | Pin 35   | PA3     | 0x0D |  RSPI0-RSPCKA (SPI CLK)        |
 *   | Pin 34   | PA4     | 0x0D |  RSPI0-SSLA0-B (SPI CS)        |
 *   | Pin 97   | PE5     | 0x07 |  GTIOC0A (Motor 0 PWM+)        |
 *   | Pin 96   | PE4     | 0x07 |  GTIOC0B (Motor 0 PWM-)        |
 *   | Pin 60   | P24     | 0x02 |  MTCLKA (Encoder 0 Phase A)    |
 *   | Pin 61   | P25     | 0x02 |  MTCLKB (Encoder 0 Phase B)    |
 *   +----------+---------+------+--------------------------------+
 * @endverbatim
 *
 * @par PFS Register Bit Layout
 * Each pin has a Pin Function Select (PFS) register:
 * @verbatim
 *   Bit 7   | Bit 6   | Bit 5    | Bits 4-0
 *   --------+---------+----------+------------------
 *   ASEL    | ISEL    | Reserved | PSEL[4:0]
 *   (Analog)| (IRQ)   |          | (Peripheral Select)
 * @endverbatim
 *
 * @par Common PSEL Values (varies by pin, check RX72N Manual Appendix)
 * | PSEL | Function Examples |
 * |------|-------------------|
 * | 0x00 | Hi-Z / General Purpose I/O |
 * | 0x02 | MTU3a clock inputs (MTCLKA-D) |
 * | 0x07 | GPTW outputs (GTIOCnA/B) |
 * | 0x0A | SCI (TXD, RXD, SCK, CTS) |
 * | 0x0D | RSPI (COPI, CIPO, RSPCK, SSL) |
 * | 0x0F | RIIC (SDA, SCL) |
 *
 * @par Example: Configure PB7 as SCI9 TXD
 * @code
 * #include "rx72n_mpc_regs.h"
 *
 * // Unlock PFS write protection
 * mpc()->pwpr = 0x00;              // Clear B0WI bit
 * mpc()->pwpr = k_mpc_pwpr_pfswe;  // Set PFSWE to enable PFS writes
 *
 * // Configure PB7 for SCI9 TXD (PSEL = 0x0A)
 * mpc()->pb7pfs = 0x0A;
 *
 * // Re-lock PFS write protection
 * mpc()->pwpr = 0x00;              // Clear PFSWE
 * mpc()->pwpr = k_mpc_pwpr_b0wi;   // Set B0WI to protect PFSWE
 *
 * // Don't forget to also enable peripheral mode in PORT PMR register!
 * @endcode
 *
 * @par NASA Power of 10 Compliance
 * - Rule 3: No dynamic memory - all register access via static inline functions
 * - Rule 5: Compile-time assertions verify all register layout assumptions
 * - Rule 8: Uses typed enums (C23) for all constants, no magic numbers
 * - Rule 10: Clean build with -Wall -Wextra -Werror
 *
 * @par SOLID Principles
 * - Single Responsibility: MPC register definitions only, no driver logic
 * - Open/Closed: Accessors work with any pin configuration
 * - Interface Segregation: Minimal API - just register access functions
 *
 * @par Manual Reference
 * RX72N Group User's Manual: Hardware, Chapter 20 (Multi-Function Pin Controller)
 *
 * @par Verification Status
 * [PASS] VERIFIED (2026-01-28) - All register addresses and offsets verified
 * against RX72N Manual Chapter 20 and Appendix pin function tables.
 *
 * @see rx72n_port_regs.h GPIO port direction and data registers
 * @see rx_mpc.h Higher-level MPC driver with PSEL constants
 *
 * @date 2026-01-28
 * @copyright Copyright (c) 2026 STAR Project
 */

#pragma once

