Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hal/inc/rx72n_mpc_regs.h
/* =============================================================================
 * Compile-Time Register Layout Verification
 * =============================================================================
 * These static assertions verify the struct layout matches hardware exactly.
 * If any assertion fails, the struct definition is WRONG and must be fixed!
 *
 * Reference: RX72N Group User's Manual: Hardware, Chapter 20, Section 20.2
 * =============================================================================
 */

/**
 * @defgroup mpc_static_assert MPC Static Assertions
 * @brief Compile-time verification of MPC register layout
 * @details
 * These static assertions are verified at compile time to ensure the
 * C structure definitions match the actual hardware register layout.
 * A failed assertion indicates a bug in the register definitions that
 * must be fixed before the code can compile.
 * @{
 */

/* Verify critical register offsets from base (0x0008C100) */
static_assert(offsetof(rx_mpc_regs_t, pfcse) == 0x00,
              "PFCSE must be at offset 0x00 (address 0x0008C100)");
static_assert(offsetof(rx_mpc_regs_t, pwpr) == 0x1F,
              "PWPR must be at offset 0x1F (address 0x0008C11F)");
static_assert(offsetof(rx_mpc_regs_t, p00pfs) == 0x40,
              "P00PFS must be at offset 0x40 (address 0x0008C140)");

/* Verify specific port offsets from P00PFS base */
static_assert(offsetof(rx_mpc_regs_t, p50pfs) == 0x40 + 0x28,
              "P50PFS must be at offset 0x68 (Port 5 base)");
static_assert(offsetof(rx_mpc_regs_t, pa0pfs) == 0x40 + 0x50,
              "PA0PFS must be at offset 0x90 (Port A base)");
static_assert(offsetof(rx_mpc_regs_t, pe0pfs) == 0x40 + 0x70,
              "PE0PFS must be at offset 0xB0 (Port E base)");
static_assert(offsetof(rx_mpc_regs_t, pj0pfs) == 0x40 + 0x90,
              "PJ0PFS must be at offset 0xD0 (Port J base)");

/* Verify struct total size (64 bytes control + 152 bytes PFS = 216 bytes) */
static_assert(sizeof(rx_mpc_regs_t) == 0x40 + 152,
              "MPC struct size must be 64 + 152 = 216 bytes total");

/** @} */ /* End of mpc_static_assert group */

/** @} */ /* End of mpc_regs group */

/* =============================================================================
 * Pin Mapping Examples
 * =============================================================================
 * Example MPC configuration for common STAR peripherals.
 * See rx_mpc.h for PSEL constant definitions and helper functions.
 *
 * 1. Configure PB7 as SCI9 TXD (Debug UART):
 *    mpc()->pwpr = 0x00;              // Clear B0WI
 *    mpc()->pwpr = k_mpc_pwpr_pfswe;  // Enable PFS write
 *    mpc()->pb7pfs = 0x0A;            // PSEL = 0x0A for SCI
 *    mpc()->pwpr = 0x00;              // Disable PFS write
 *    mpc()->pwpr = k_mpc_pwpr_b0wi;   // Protect PFSWE
 *
 * 2. Configure PE5 as GTIOC0A (Motor 0 PWM Phase):
 *    mpc()->pwpr = 0x00;
 *    mpc()->pwpr = k_mpc_pwpr_pfswe;
 *    mpc()->pe5pfs = 0x07;            // PSEL = 0x07 for GPTW
 *    mpc()->pwpr = 0x00;
 *    mpc()->pwpr = k_mpc_pwpr_b0wi;
 *
 * 3. Configure P24 as MTCLKA (Encoder 0 Phase A):
 *    mpc()->pwpr = 0x00;
 *    mpc()->pwpr = k_mpc_pwpr_pfswe;
 *    mpc()->p24pfs = 0x02;            // PSEL = 0x02 for MTU CLK
 *    mpc()->pwpr = 0x00;
 *    mpc()->pwpr = k_mpc_pwpr_b0wi;
 *
 * 4. Configure PA4 as SSLA0-B (RPi5 SPI Chip Select):
 *    mpc()->pwpr = 0x00;
 *    mpc()->pwpr = k_mpc_pwpr_pfswe;
 *    mpc()->pa4pfs = 0x0D;            // PSEL = 0x0D for RSPI
 *    mpc()->pwpr = 0x00;
 *    mpc()->pwpr = k_mpc_pwpr_b0wi;
 *
 * Note: After MPC configuration, also set PMR (Port Mode Register) bit to '1'
 * to enable peripheral mode. See rx_mpc.h for helper functions and named constants.
 */

#ifdef __cplusplus
}
#endif
